Revit 2026 API

# Camera Constructor

---

Camera

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Camera(
	Camera other
)
```
```vb
Public Sub New (
	other As Camera
)
```
```cpp
public:
Camera(
	Camera^ other
)
```
```fsharp
new :
        other : Camera -> Camera
```

#### Parameters

other Camera

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace